doc/surface_integrals.org
#+title: Evaluating line and surface integrals to implement boundary conditions
#+AUTHOR: Constantine Khroulev
#+LATEX_HEADER: \usepackage[margin=1in]{geometry}
#+LATEX_HEADER: \parindent=0in \parskip=0.5\baselineskip
#+OPTIONS: author:t date:t email:nil toc:t

#+BEGIN_LaTeX
\newcommand{\dx}{\Delta x}
\newcommand{\dy}{\Delta y}
\newcommand{\Real}{\mathbb{R}}
\newcommand{\diff}[2]{\frac{\partial #1}{\partial #2}}
\newcommand{\rs}{\R_{s}}
\newcommand{\rt}{\R_{t}}
\newcommand{\R}{\vec r}
\newcommand{\N}{\vec n}
\newcommand{\rRef}{\R_{*}}
#+END_LaTeX

#+BEGIN_SRC emacs-lisp :results value :exports results
  (org-babel-tangle)
  nil
#+END_SRC

* Introduction

To implement Neumann boundary conditions in a FEM solver we need to be
able to evaluate integrals over element boundaries. In the
two-dimensional case this requires computing /line integrals/; in the
three-dimensional case --- /surface integrals/. In these notes I
describe how to use element maps to approximate these integrals using
quadratures.

Karniadakis and Sherwin mention this in section 4.1.4 (page 160) of
\cite{KarniadakisSherwin}, but use an unhelpful name /surface
Jacobian/ and don't go into details.

* Preliminaries

** Line integrals

For some scalar function $F : U \subset \Real^{n} \to \Real$
the integral along a piecewise smooth curve $C \subset U$ is defined as
\begin{equation}
\label{eq:4}
\int_{C} F\, ds = \int_{a}^{b} F(\R(t))\, \left| \frac{d}{dt}\R(t) \right|\, dt,
\end{equation}
where $\R: [a, b] \to C$ is a bijective parameterization of the curve
$C$ \cite{Nikolsky1977}.

** Surface integrals

Let $\Omega \subset \Real^{2}$ be a measurable subset of the
plane and define $\R(s,t) = (x(s,t), y(s,t), z(s,t))$, where $x(s,
t)$, $y(s, t)$, and $z(s, t)$ are continuously differentiable
functions defined on $\Omega$. Then $S = \R(\Omega) \subset
\Real^{3}$ is a smooth surface parameterized by $\R$.

Vectors $\rs$ and $\rt$ are tangential vectors to the surface $S$
given by the parameterization $\R(s,t)$.

If $\rs$ and $\rt$ are not parallel, then $\N = \rs \times \rt$ is
a normal vector, $| \N | > 0$, and we can define
the integral
\begin{equation}
\label{eq:3}
\int_{S} F\, dS = \int_{\Omega} F\, |\N|\, ds dt.
\end{equation}

Here
\begin{equation}
\label{eq:5}
\rs = \left(\diff{x(s,t)}{s}, \diff{y(s,t)}{s}, \diff{z(s,t)}{s}\right) \quad \text{and} \quad
\rt = \left(\diff{x(s,t)}{t}, \diff{y(s,t)}{t}, \diff{z(s,t)}{t}\right).
\end{equation}
See \cite{Nikolsky1977} or any other Calculus textbook for details.


* Boundaries of quadrilateral elements

A 2D FEM construction includes the map from the reference element
$E_{*} = [-1, 1] \times [-1,1]$ to a physical element:

\begin{equation}
\label{eq:20}
\rRef(\xi,\eta) = \left( x(\xi,\eta), y(\xi,\eta) \right).
\end{equation}

A side of the reference element is mapped to the corresponding side of
the physical element. We number faces as follows.
\begin{equation}
\label{eq:21}
\begin{aligned}
C_{*,1} &=  E_{*} \cap \left \{ (\xi, \eta)\, |\, \xi = -1 \right \},\\
C_{*,2} &=  E_{*} \cap \left \{ (\xi, \eta)\, |\, \xi = 1  \right \},\\
C_{*,3} &=  E_{*} \cap \left \{ (\xi, \eta)\, |\, \eta = -1 \right \},\\
C_{*,4} &=  E_{*} \cap \left \{ (\xi, \eta)\, |\, \eta = 1  \right \}.
\end{aligned}
\end{equation}
Now sides of a physical element are $C_{E,i} = \rRef(C_{*,i})$. The
face $C_{E,1}$ is parameterized by
\begin{equation}
\label{eq:22}
\R_{E,1}(t) = \rRef(-1, t),
\end{equation}
and so on.

** Example: evaluating integrals over sides of $Q_{1}$ quad elements

In this example I use the first ("left") side, but computations for
all sides are similar.

Let $(\xi_{i}, \eta_{i}), i = 1,\dots,4$ be coordinates of the nodes
of the reference element $E_{*}$ and $(x_{i}, y_{i})$ be coordinates
of the nodes of a physical element $E$.

Let $F(x,y)$ be a function defined on the FEM mesh and on $C_{E,1}$ in
particular. Assume that we know its nodal values
\begin{equation}
\label{eq:23}
F_{i} = F(x_{i}, y_{i}).
\end{equation}

Our goal is to approximate the integral
\begin{equation}
\label{eq:24}
I = \int_{C_{E,1}} F(x,y)\, ds
\end{equation}

In this case the map $\rRef$ is defined by \eqref{eq:20} and
\begin{equation}
\label{eq:25}
\begin{aligned}
x(\xi,\eta) &= \sum_{i=1}^{4} x_{i}\, \chi_{i}(\xi, \eta),\\
y(\xi,\eta) &= \sum_{i=1}^{4} y_{i}\, \chi_{i}(\xi, \eta),\\
\end{aligned}
\end{equation}
where
\begin{equation}
\label{eq:26}
\chi_{i}(\xi,\eta) = \frac14 (1 + \xi\xi_{i})(1 + \eta\eta_{i})
\end{equation}
are $Q_{1}$ reference element basis function.

Now we can rewrite $I$
\begin{equation}
\label{eq:27}
I = \int_{-1}^{1} F(x(-1, t), y(-1, t))\, \left|\frac{d}{dt}\R(t) \right|\, dt.
\end{equation}

Here
\begin{align}
\label{eq:28}
\R_{1}(t) &= \left( x(-1,t),\, y(-1,t) \right),\\
\frac{d}{dt} \R_{1}(t) &= \left( \sum_{i=1}^{4} x_{i}\, \frac{d}{dt}\chi_{i}(-1, t),\,
                                 \sum_{i=1}^{4} y_{i}\, \frac{d}{dt}\chi_{i}(-1, t)  \right).
\end{align}

The integral in \eqref{eq:27} is a /regular/ definite integral over
the interval $[-1, 1]$ and can be approximated using a quadrature.

\begin{equation}
\label{eq:29}
I \approx \sum_{q=1}^{N_{q}} w_{q}\, F(x(-1, t_{q}), y(-1, t_{q}))\, \left|\frac{d}{dt}\R(t_{q}) \right|.
\end{equation}

Now we just need to approximate $F(x(-1, t_{q}), y(-1, t_{q}))$ by
a bilinear function built on \eqref{eq:26}:
\begin{equation}
\label{eq:30}
F(x(-1, t), y(-1, t)) \approx \sum_{j=1}^{4} F_{j}\, \chi_{j}(-1, t)
\end{equation}
so that
\begin{equation}
\label{eq:31}
I \approx \sum_{q=1}^{N_{q}} w_{q}\,
\left( \sum_{j=1}^{4} F_{j}\, \chi_{j}(-1, t_{q}) \right) \,
\left| \frac{d}{dt}\R(t_{q}) \right|.
\end{equation}

In the equal spacing case ($x_{4} = x_{1}$, $x_{2} = x_{3} = x_{1} +
\dx$, $y_{2} = y_{1}$, $y_{3} = y_{4} = y_{1} + \dy$ everything is much simpler:
#+RESULTS[611bcb77c42631074ef7d22cc8b78450d9116fca]: equal_spacing_2d
#+BEGIN_LaTeX
\begin{align*}
\left| \frac{d}{dt}\R_{1}\right|  & = \frac{\dy}{2}, \\
\left| \frac{d}{dt}\R_{2}\right|  & = \frac{\dy}{2}, \\
\left| \frac{d}{dt}\R_{3}\right|  & = \frac{\dx}{2}, \\
\left| \frac{d}{dt}\R_{4}\right|  & = \frac{\dx}{2}. \\
\end{align*}
#+END_LaTeX

*** Maxima code used in the 2D equal spacing case

#+name: equal_spacing_2d
#+BEGIN_SRC maxima :results output latex :cache yes :exports both
  assume(dx > 0, dy > 0)$
  texput(dx, "\\dx")$
  texput(dy, "\\dy")$
  texput(nounify(T), "\\frac{d}{dt}\\R")$

  /* coordinates of the nodes of the reference element */
  xis   : [-1,  1,  1, -1]$
  etas  : [-1, -1,  1,  1]$

  /* Reference element basis functions */
  chi[i](xi, eta) := (1/4) * (1 + xi*xis[i]) * (1 + eta*etas[i])$

  /* The isoparametric map from the reference to a physical element. */
  x(xi, eta) := sum(x[j] * chi[j](xi, eta), j, 1, 4)$
  y(xi, eta) := sum(y[j] * chi[j](xi, eta), j, 1, 4)$

  /* sides of the reference hexahedron */
  sides : [
    [-1, t], [1, t],
    [t, -1], [t, 1]
  ]$

  /* parameterizations of sides */
  R[j] := [funmake(x, sides[j]), funmake(y, sides[j])]$

  equal_horizontal_spacing : [
    x[3] = x[2], x[4] = x[1], x[2] = x[1] + dx,
    y[2] = y[1], y[4] = y[3], y[3] = y[1] + dy
  ]$

  /* tangential vector */
  T[j] := diff(R[j], t)$
  vnorm[j] := sqrt(T[j] . T[j])$

  eq_simplify(e) := expand(subst(equal_horizontal_spacing, ev(e, nouns)))$

  tex_align(makelist(abs('T[j]) = eq_simplify(vnorm[j]), j, 1, 4))$
#+END_SRC

