doc/surface_integrals.org
* Boundaries of hexahedral elements

A 3D FEM construction includes the map from the reference element
$E_{*} = [-1, 1] \times [-1,1] \times [-1,1]$ to a physical element:

\begin{equation}
\label{eq:6}
\rRef(\xi,\eta,\zeta) = \left( x(\xi,\eta,\zeta), y(\xi,\eta,\zeta), z((\xi,\eta,\zeta) \right)
\end{equation}

Note that $\rRef$ maps a face of the reference element to the
corresponding face of a physical element. We number the faces of the
reference element as follows.

\begin{equation}
\label{eq:7}
\begin{aligned}
S_{*,1} &=  E_{*} \cap \left \{ (\xi, \eta, \zeta)\, |\, \xi = -1 \right \},\\
S_{*,2} &=  E_{*} \cap \left \{ (\xi, \eta, \zeta)\, |\, \xi = 1  \right \},\\
S_{*,3} &=  E_{*} \cap \left \{ (\xi, \eta, \zeta)\, |\, \eta = -1 \right \},\\
S_{*,4} &=  E_{*} \cap \left \{ (\xi, \eta, \zeta)\, |\, \eta = 1  \right \},\\
S_{*,5} &=  E_{*} \cap \left \{ (\xi, \eta, \zeta)\, |\, \zeta = -1 \right \},\\
S_{*,6} &=  E_{*} \cap \left \{ (\xi, \eta, \zeta)\, |\, \zeta = 1  \right \}.
\end{aligned}
\end{equation}

Then faces of a physical element are $S_{E,i} = \rRef(S_{*,i})$.
The face $S_{E,1}$ is parameterized by
\begin{equation*}
\label{eq:8}
\R_{E,1}(s, t) = \rRef(-1,s,t),
\end{equation*}
and so on.

** Example: evaluating an integral over a face of a $Q_{1}$ element.

#+BEGIN_LaTeX
\newcommand{\face}{S_{E,5}}
#+END_LaTeX

In this example I use the fifth, or "bottom" face, but all
computations are very similar in the five other cases.

Let $(\xi_{i}, \eta_{i}, \zeta_{i})$, $i = 1,\dots,8$ be coordinates
of the nodes of the reference element $E_{*}$ and $(x_{i}, y_{i},
z_{i})$ the coordinates of the nodes of a physical element $E$.

Let $F(x,y,z)$ be a function defined on the FEM mesh and on $\face$
in particular. Assume that we know its nodal values
\begin{equation*}
F_{i} = F(x_{i}, y_{i}, z_{i}).
\end{equation*}

Our goal is to approximate the integral
\begin{equation}
\label{eq:13}
I = \int_{\face} F(x,y,z)\, dS.
\end{equation}

In this case the map $\rRef$ is defined by \eqref{eq:6} and
\begin{equation}
\label{eq:9}
\begin{aligned}
x(\xi,\eta,\zeta) &= \sum_{i=1}^{8} x_{i}\, \chi_{i}(\xi, \eta, \zeta),\\
y(\xi,\eta,\zeta) &= \sum_{i=1}^{8} y_{i}\, \chi_{i}(\xi, \eta, \zeta),\\
z(\xi,\eta,\zeta) &= \sum_{i=1}^{8} z_{i}\, \chi_{i}(\xi, \eta, \zeta),
\end{aligned}
\end{equation}
where
\begin{equation}
\label{eq:10}
\chi_{i}(\xi,\eta,\zeta) = \frac18 (1 + \xi\xi_{i})(1 + \eta\eta_{i})(1 + \zeta\zeta_{i})
\end{equation}
are $Q_{1}$ reference element basis function.

We can now rewrite $I$ using \eqref{eq:6}, \eqref{eq:9}, and the definition of the surface integral:
\begin{equation}
\label{eq:11}
I = \int_{E_{*}} F(x(s,t,-1), y(s,t,-1), z(s,t,-1))\, | \N(s,t) |\,dsdt,
\end{equation}
where $\N(s,t) = \rs(s,t) \times \rt(s,t)$ and
\begin{equation}
\label{eq:5}
\begin{aligned}
\rs(s,t) &= \left(\diff{x(s,t,-1)}{s}, \diff{y(s,t,-1)}{s}, \diff{z(s,t,-1)}{s}\right),\\
\rt(s,t) &= \left(\diff{x(s,t,-1)}{t}, \diff{y(s,t,-1)}{t}, \diff{z(s,t,-1)}{t}\right),
\end{aligned}
\end{equation}
since the face $\face$ is parameterized by $\R_{E,5}(s, t) = \rRef(s, t, -1)$.

The integral $I$ written in the form \eqref{eq:11} can be approximated
using a quadrature on the reference element, i.e.
\begin{equation}
\label{eq:12}
I \approx \sum_{q=1}^{N_{q}} w_{q}\cdot F(x(s_{q},t_{q},-1), y(s_{q},t_{q},-1), z(s_{q},t_{q},-1)) | \N(s_{q},t_{q}) |,
\end{equation}
where $w_{q}$ are quadrature weights and $s_{q}, t_{q}$ are
coordinates of quadrature points.

To compute this quadrature we need
$F(x(s_{q},t_{q},-1), y(s_{q},t_{q},-1), z(s_{q},t_{q},-1))$, but we
assume that only nodal values of $F$ are available.

We use \eqref{eq:10} as a basis to write a trilinear approximation of $F$ on $\face$:
\begin{equation}
\label{eq:14}
F(s,t) \approx \sum_{k=1}^{8} F_{k}\,\chi_{k}(s, t, -1),
\end{equation}
then
\begin{equation}
\label{eq:15}
I \approx \sum_{q=1}^{N_{q}} w_{q}\left( \sum_{k=1}^{8} F_{k}\,\chi_{k}(s_{q}, t_{q}, -1) \right) | \N(s_{q},t_{q}) |,
\end{equation}

Finally, to evaluate $|\N(s_{q}, t_{q})| = | \rs(s_{q}, t_{q}) \times
\rt(s_{q}, t_{q}) |$ we use \eqref{eq:5} and \eqref{eq:9}.
The vector $\rs(s_{q}, t_{q})$ is defined by
\begin{equation}
\label{eq:16}
\rs(s_{q},t_{q}) = \left(
  \sum_{j=1}^{8} x_{j} \left.\diff{\chi_{j}(s, t, -1)}{s}\right|_{(s_{q}, t_{q})},\,
  \sum_{j=1}^{8} y_{j} \left.\diff{\chi_{j}(s, t, -1)}{s}\right|_{(s_{q}, t_{q})},\,
  \sum_{j=1}^{8} z_{j} \left.\diff{\chi_{j}(s, t, -1)}{s}\right|_{(s_{q}, t_{q})} \right),
\end{equation}
similarly for $\rt(s_{q}, t_{q})$.

Overall, here are the steps needed to approximate \eqref{eq:13}.

1. Pre-compute $\chi_{j}(s_{q}, t_{q}, -1)$ for $\face$ and similarly
   for the remaining five faces.
2. Pre-compute $\diff{\chi_{i}(s, t, -1)}{s}$ and
   $\diff{\chi_{i}(s, t, -1)}{t}$ and $(s_{q}, t_{q})$ for $\face$ and similarly for
   other faces.

Then for each quadrature point we need to

1. use pre-computed values to approximate $\rs(s_{q},t_{q})$ and
   $\rt(s_{q},t_{q})$ (see \eqref{eq:16}),
2. compute $|\N(s_{q}, t_{q})| = | \rs(s_{q}, t_{q}) \times \rt(s_{q}, t_{q}) |$,
3. approximate $F(s_{q}, t_{q})$ using \eqref{eq:14},
4. multiply to evaluate a term of \eqref{eq:15}.

