doc/latex/surface_integrals.tex

\subsubsection{Equal horizontal spacing}
\label{sec-4-1-1}

The procedure described above can be simplified if we know that the
FEM mesh uses regular spacing in the $x$ and $y$ directions, i.e.
$x$ and $y$ coordinates of the nodes of a physical element are
\begin{equation}
\label{eq:17}
\begin{array}{rcllllllll}
x_{i} &=& \{ x_{1}, &x_{1} + \dx, &x_{1} + \dx, &x_{1}, &x_{1}, &x_{1} + \dx, &x_{1} + \dx, &x_{1} \},\\
y_{i} &=& \{ y_{1}, &y_{1}, &y_{1} + \dy, &y_{1} + \dy, &y_{1}, &y_{1}, &y_{1} + \dy, &y_{1} + \dy \};\\
\end{array}
\end{equation}
$z_{i}$ are may all be different.

In this case \eqref{eq:16} simplifies to
\begin{equation}
\label{eq:18}
\rs(s,t) = \left(
  \frac{\dx}{2},\,
  0,\,
  \sum_{i=1}^{8} z_{i} \diff{\chi_{i}(s, t, -1)}{s} \right),
\end{equation}
and $\rt(s,t)$ is given by
\begin{equation}
\label{eq:18}
\rt(s,t) = \left(
  0,\,
  \frac{\dy}{2},\,
  \sum_{i=1}^{8} z_{i} \diff{\chi_{i}(s, t, -1)}{t} \right).
\end{equation}

With these simplifications $\N(s,t)$ becomes

\begin{equation}
\label{eq:19}
\N(s,t) = \left(
-\frac{\dy}{2}\diff{z(s,t,-1)}{s},
-\frac{\dx}{2}\diff{z(s,t,-1)}{t},
\frac{1}{4} \dx \dy
\right)
\end{equation}

Note that if all $z_{i}$ are equal, $|\N| = \frac{1}{4} \dx \dy$ is
equal to the determinant of the Jacobian of the map from the reference
element to a physical element in the 2D $Q_{1}$ FEM setup with equal
spacing in $x$ and $y$ directions --- as expected.

The only thing that changes depending on the face we're integrating
over is the expression for $|\N|$. Below are formulas for all six
faces (assuming equal horizontal spacing and using the numbering
defined by \eqref{eq:7}).

\begin{align*}
 \N_{1} & = \left[ \frac{\frac{d}{d\,t}\,z\left(-1 , s , t\right)\,\dy}{2} , 0 , 0 \right] , \\
 \N_{2} & = \left[ \frac{\frac{d}{d\,t}\,z\left(1 , s , t\right)\,\dy}{2} , 0 , 0 \right] , \\
 \N_{3} & = \left[ 0 , -\frac{\dx\,\left(\frac{d}{d\,t}\,z\left(s , -1 , t\right)\right)}{2} , 0 \right] , \\
 \N_{4} & = \left[ 0 , -\frac{\dx\,\left(\frac{d}{d\,t}\,z\left(s , 1 , t\right)\right)}{2} , 0 \right] , \\
 \N_{5} & = \left[ -\frac{\dy\,\left(\frac{d}{d\,s}\,z\left(s , t , -1\right)\right)}{2} , -\frac{\dx\,\left(\frac{d}{d\,t}\,z\left(s , t , -1\right)\right)}{2} , \frac{\dx\,\dy}{4} \right] , \\
 \N_{6} & = \left[ -\frac{\dy\,\left(\frac{d}{d\,s}\,z\left(s , t , 1\right)\right)}{2} , -\frac{\dx\,\left(\frac{d}{d\,t}\,z\left(s , t , 1\right)\right)}{2} , \frac{\dx\,\dy}{4} \right] . \\
\end{align*}
\begin{align*}
 \left| \N_{1}\right|  & = \frac{\left| \frac{d}{d\,t}\,z\left(-1 , s , t\right)\right| \,\dy}{2}, \\
 \left| \N_{2}\right|  & = \frac{\left| \frac{d}{d\,t}\,z\left(1 , s , t\right)\right| \,\dy}{2}, \\
 \left| \N_{3}\right|  & = \frac{\dx\,\left| \frac{d}{d\,t}\,z\left(s , -1 , t\right)\right| }{2}, \\
 \left| \N_{4}\right|  & = \frac{\dx\,\left| \frac{d}{d\,t}\,z\left(s , 1 , t\right)\right| }{2}, \\
 \left| \N_{5}\right|  & = \sqrt{\frac{\dx^2\,\left(\frac{d}{d\,t}\,z\left(s , t , -1\right)\right)^2}{4}+\frac{\dy^2\,\left(\frac{d}{d\,s}\,z\left(s , t , -1\right)\right)^2}{4}+\frac{\dx^2\,\dy^2}{16}}, \\
 \left| \N_{6}\right|  & = \sqrt{\frac{\dx^2\,\left(\frac{d}{d\,t}\,z\left(s , t , 1\right)\right)^2}{4}+\frac{\dy^2\,\left(\frac{d}{d\,s}\,z\left(s , t , 1\right)\right)^2}{4}+\frac{\dx^2\,\dy^2}{16}}. \\
\end{align*}

\subsubsection{Maxima code used in the 3D equal spacing case}
\label{sec-4-1-2}

\begin{verbatim}
assume(dx > 0, dy > 0)$
texput(dx, "\\dx")$
texput(dy, "\\dy")$
texput(nounify(N), "\\N")$

load(vect)$ /* now ~ is the vector cross product */
vecnorm(V) := sqrt(V . V)$

/* coordinates of the nodes of the reference element */
xis   : [-1,  1,  1, -1, -1,  1, 1, -1]$
etas  : [-1, -1,  1,  1, -1, -1, 1,  1]$
zetas : [-1, -1, -1, -1,  1,  1, 1,  1]$

/* Reference element basis functions */
chi[i](xi, eta, zeta) := (1/8) * (1 + xi*xis[i]) * (1 + eta*etas[i]) * (1 + zeta*zetas[i])$

/* The isoparametric map from the reference to a physical element. */
x(xi, eta, zeta) := sum(x[j] * chi[j](xi, eta, zeta), j, 1, 8)$
y(xi, eta, zeta) := sum(y[j] * chi[j](xi, eta, zeta), j, 1, 8)$
/* z is similar, but I don't need to define it */
depends(z, [xi, eta, zeta])$

/* faces of the reference hexahedron */
faces : [
  [-1, s,  t], [1, s, t],
  [s, -1,  t], [s, 1, t],
  [s,  t, -1], [s, t, 1]
]$

/* parameterizations of faces */
R[j] := [funmake(x, faces[j]), funmake(y, faces[j]), funmake(z, faces[j])]$

equal_horizontal_spacing : [
  x[3] = x[2], x[4] = x[1], x[5] = x[1], x[6] = x[2], x[7] = x[2], x[8] = x[1],
  x[2] = x[1] + dx,
  y[2] = y[1], y[4] = y[3], y[5] = y[1], y[6] = y[1], y[7] = y[3], y[8] = y[3],
  y[3] = y[1] + dy
]$

/* tangential vectors */
T[j] := [diff(R[j], s), diff(R[j], t)]$
/* normal vectors */
N[j] := express(T[j][1] ~ T[j][2])$
/* magnitudes of normal vectors */
vnorm[j] := vecnorm(N[j])$

eq_simplify(e) := expand(subst(equal_horizontal_spacing, ev(e, nouns)))$

tex_align(makelist('N[j] = eq_simplify(N[j]), j, 1, 6))$
tex_align(makelist(abs('N[j]) = eq_simplify(vnorm[j]), j, 1, 6))$
\end{verbatim}

\section{BibTeX entries and references}
\label{sec-5}

\bibliography{references}
\bibliographystyle{plain}

\begin{verbatim}
@book{KarniadakisSherwin,
  title={Spectral/hp {E}lement {M}ethods for {C}omputational {F}luid {D}ynamics},
  author={G. Karniadakis and S. Sherwin},
  year={2013},
  edition={2nd},
  publisher={Oxford University Press},
}

@book{Nikolsky1977,
  title={A course of Mathematical Analysis, volume 2},
  year={1977},
  author={Nikolsky, S.~M.},
  publisher={MIR Publishers, Moscow}
}
\end{verbatim}
% Emacs 24.5.1 (Org mode 8.2.10)
\end{document}